In [68]:
import numpy as np
import pandas as pd

In [85]:
marks=pd.Series([100,88,56,86,99],index=['no1','no2','no3','no4','no5'])
marks

no1    100
no2     88
no3     56
no4     86
no5     99
dtype: int64

In [86]:
dataframe_marks=pd.DataFrame({"Marks":marks})
dataframe_marks

     Marks
no1    100
no2     88
no3     56
no4     86
no5     99

In [90]:
grade=pd.Series(['A','C','F','B','A++'],index=['no1','no2','no3','no4','no6'])
grade

no1      A
no2      C
no3      F
no4      B
no6    A++
dtype: object

In [91]:
dataframe_grade=pd.DataFrame({'Grades':grade})
dataframe_grade

    Grades
no1      A
no2      C
no3      F
no4      B
no6    A++

In [92]:
datframe_result=pd.DataFrame({'Marks':marks , 'Grades':grade})
datframe_result

     Marks Grades
no1  100.0      A
no2   88.0      C
no3   56.0      F
no4   86.0      B
no5   99.0    NaN
no6    NaN    A++

In [119]:
datframe_result[0:2]

     Marks Grades
no1  100.0      A
no2   88.0      C

In [115]:
a=datframe_result.loc[['no4','no3','no1']]
a

     Marks Grades
no4   86.0      B
no3   56.0      F
no1  100.0      A

In [125]:
datframe_result.iat[3,1]

'B'

In [130]:
datframe_result[datframe_result['Marks']>88]

     Marks Grades
no1  100.0      A
no5   99.0    NaN

In [131]:
datframe_result.dropna()

     Marks Grades
no1  100.0      A
no2   88.0      C
no3   56.0      F
no4   86.0      B

In [133]:
datframe_result.fillna(0)

     Marks Grades
no1  100.0      A
no2   88.0      C
no3   56.0      F
no4   86.0      B
no5   99.0      0
no6    0.0    A++

In [148]:
l1=[1,2,3]
s1=pd.Series(l1,index=['no1','no2','no3'])
d1={'Score':s1}
df1=pd.DataFrame(d1)

l2=[4,5,6]
s2=pd.Series(l2,index=['no1','no2','no4'])
d2={'City':s2}
df2=pd.DataFrame(d2)

In [149]:
df1

     Score
no1      1
no2      2
no3      3

In [150]:
df2

     City
no1     4
no2     5
no4     6

In [153]:
df3=df1.add(df2)
df3

     City  Score
no1   NaN    NaN
no2   NaN    NaN
no3   NaN    NaN
no4   NaN    NaN

In [156]:
df3=df1.add(df2,fill_value=0)
df3

     City  Score
no1   4.0    1.0
no2   5.0    2.0
no3   NaN    3.0
no4   6.0    NaN

In [158]:
s3=s1.add(s2)
s3

no1    5.0
no2    7.0
no3    NaN
no4    NaN
dtype: float64

In [159]:
s3=s1.add(s2,fill_value=0)
s3

no1    5.0
no2    7.0
no3    3.0
no4    6.0
dtype: float64

In [163]:
df3.columns

Index(['City', 'Score'], dtype='object')

In [172]:
s4=df3['City']
s4

no1    4.0
no2    5.0
no3    NaN
no4    6.0
Name: City, dtype: float64

In [173]:
s5=df3['Score']
s5

no1    1.0
no2    2.0
no3    3.0
no4    NaN
Name: Score, dtype: float64

In [169]:
df3

     City  Score
no1   4.0    1.0
no2   5.0    2.0
no3   NaN    3.0
no4   6.0    NaN